       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPGM.
       PROCEDURE DIVISION.
       MAIN-PARA.
           IF WS-A = 0
               DISPLAY 'TRUE'
           ELSE
               DISPLAY 'FALSE'
           END-IF.
           STOP RUN.
