       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPGM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       COPY DFHAID.

       PROCEDURE DIVISION.
       MAIN-PARA.
           STOP RUN.
