       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TESTPGM. 
       PROCEDURE DIVISION. 
       MAIN-PARA. 
           IF WS-A = 0 
               DISPLAY 'HELLO' 
           END-IF. 
           STOP RUN.
