       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CSSETATY REPLACING FOO BY BAR.
       PROCEDURE DIVISION.
       MAIN-PARA.
           STOP RUN.
