       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPGM.
       PROCEDURE DIVISION.
       MAIN-PARA.
           SET ERR-FLG-OFF TO TRUE.
           MOVE SPACES TO WS-MESSAGE.
           STOP RUN.
