       IDENTIFICATION DIVISION.  
       PROGRAM-ID. TESTPGM.  
       PROCEDURE DIVISION.  
       MAIN-PARA.  
           DISPLAY 'HELLO'.  
           STOP RUN.  
