       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CSSETATY REPLACING
         ==(TESTVAR1)== BY ==ACCT-STATUS==
         ==(SCRNVAR2)== BY ==ACSTTUS==
         ==(MAPNAME3)== BY ==CACTUPA== .
       PROCEDURE DIVISION.
       MAIN-PARA.
           STOP RUN.
