       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FIELD PIC X(100).
          88 HTML-L08 VALUE '<table align=""center"" frame=""box"" styl
      -          'e=""width:70%"">'.
       PROCEDURE DIVISION.
           STOP RUN.
